app/views/pages/_menu.html.erb

SELECT "pages".* FROM "pages"
---
    <a href="./">Domů</a>
    <% Page.all.each do |page| %>