app/views/pages/show.html.erb

  <div class="row">
    <% @page.courses.each do |course| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."page_id" = ?  [["page_id", 7]]