app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
  def index
    @pages = Page.all

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @page = Page.find(params[:id])

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @page = Page.find(params[:id])

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pages" SET "text" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["text", "jakubdfds f"], ["updated_at", "2016-11-23 07:22:15.637008"], ["id", 3]]
---
  def update
    @page = Page.find(params[:id])

    if @page.update(page_params)

INSERT INTO "pages" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "DSDSsssds"], ["text", "dsds"], ["created_at", "2016-11-22 07:04:07.105927"], ["updated_at", "2016-11-22 07:04:07.105927"]]
---
  def create
    @page = Page.new(page_params)
    if @page.save

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy